//пример 1
let a = 1,
  b = 1,
  c,
  d;
c = ++a;
alert(c); // ответ: 2
//тут мы объявили 4 переменные, для а и б присвоили значения
//с и д просто пока объявили
//далее в с мы присваиваем то чему равно а, но предварительно наращиваем а на 1

//пример 2
d = b++;
alert(d); //ответ: 1
//суть таже что и в первом примере но порядок другой: сначала присвоили в д то что
//было в б, а потом б нарастили на 1

//пример 3
c = 2 + ++a;
alert(c); //ответ: 5
//сразу забываем что было в с, затираем его следующим значением:
//сначала нарастили а, в первом примере у нас а стало равно 2, теперь же мы еще
//раз нарастили а на 1 и добавляем эту двойку, итого в с присваиваем результат 2+3

//пример 4
d = 2 + b++;
alert(d); //ответ: 4
//тоже самое что и во втором примере - постинкремент,
//сначала сложили 2 и б (б была равна 2 после примера №2)
//итого затираем Д на 2 + 2

alert(a); //3
//мы увеличили а в примере 1 на еденицу и в примере 3 на еденицу
alert(b); //3
//мы увеличили б в примере 2 на еденицу и в примере 4 на еденицу
